; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (p7 ?x ?y)
		(p4 ?c)
		(p2 ?l)
		(p1 ?l)
		(p3 ?c ?l)
		(p5)
		(p6 ?c))

   (:action a3
       :parameters  (?from ?to)
       :precondition (and (p7 ?from ?to) 
                          (p2 ?from) (p2 ?to) (p1 ?from))
       :effect (and  (p1 ?to)
		     (not (p1 ?from))))


   (:action a2
       :parameters (?p4 ?loc)
       :precondition  (and  (p4 ?p4) (p2 ?loc)
			    (p3 ?p4 ?loc) (p1 ?loc) (p5))
       :effect (and (p6 ?p4)
		    (not (p3 ?p4 ?loc)) 
		    (not (p5))))

   (:action a1
       :parameters  (?p4  ?loc)
       :precondition  (and  (p4 ?p4) (p2 ?loc)
			    (p6 ?p4) (p1 ?loc))
       :effect (and (p3 ?p4 ?loc)
		    (p5)
		    (not (p6 ?p4)))))

; problem
(define (problem ferry-o7-c3)
(:domain ferry)
(:objects o4 o6 o1 
          o2 o3 o5 
)
(:init
(p2 o4)
(p2 o6)
(p2 o1)
(p4 o2)
(p4 o3)
(p4 o5)
(p7 o4 o6)
(p7 o6 o4)
(p7 o4 o1)
(p7 o1 o4)
(p7 o6 o1)
(p7 o1 o6)
(p5)
(p3 o2 o1)
(p3 o3 o1)
(p3 o5 o1)
(p1 o4)
)
(:goal
(and
(p3 o2 o6)
(p3 o3 o4)
(p3 o5 o4)
)
)

(:constraints
  (and
    (sometime-before  (p3 o2 o6) (p1 o4))
    (sometime-before  (p3 o3 o4) (p1 o6))
    (sometime-before  (p3 o5 o4) (p1 o6))
  )
)
)

; plan
1. (a3 o4 o1)
   deleted: (p1 o4)
   added: (p1 o1)
   goals met: 0 of 3
2. (a2 o2 o1)
   deleted: (p3 o2 o1) (p5)
   added: (p6 o2)
   goals met: 0 of 3
3. (a3 o1 o6)
   deleted: (p1 o1)
   added: (p1 o6)
   goals met: 0 of 3
4. (a1 o2 o6)
   deleted: (p6 o2)
   added: (p3 o2 o6) (p5)
   goals met: 1 of 3
5. (a3 o6 o1)
   deleted: (p1 o6)
   added: (p1 o1)
   goals met: 1 of 3
6. (a2 o5 o1)
   deleted: (p3 o5 o1) (p5)
   added: (p6 o5)
   goals met: 1 of 3
7. (a3 o1 o4)
   deleted: (p1 o1)
   added: (p1 o4)
   goals met: 1 of 3
8. (a1 o5 o4)
   deleted: (p6 o5)
   added: (p3 o5 o4) (p5)
   goals met: 2 of 3
9. (a3 o4 o1)
   deleted: (p1 o4)
   added: (p1 o1)
   goals met: 2 of 3
10. (a2 o3 o1)
   deleted: (p3 o3 o1) (p5)
   added: (p6 o3)
   goals met: 2 of 3
11. (a3 o1 o4)
   deleted: (p1 o1)
   added: (p1 o4)
   goals met: 2 of 3
12. (a1 o3 o4)
   deleted: (p6 o3)
   added: (p3 o3 o4) (p5)
   goals met: 3 of 3
